#include <iostream>
#include <locale>
#include <tchar.h>

int _tmain(int argc, _TCHAR* argv[])
{
    unsigned int h1; // Текущее время в часах
    unsigned int m1; // Текущее время в минутах
    // Установка русской локали для терминала Windows 11
	system("chcp 1251 >nul");// 1-й способ. Выплнить внешнюю команду.
    // 2 - й способ. Вызов библиотечной функции.
	setlocale(LC_ALL, "russian.1251");
    // 3 - й способ. Создать переменную типа локали
    std::locale rus_locale = std::locale("russian.1251");
    // 3 - й способ. Выбор кодировки (локали) терминала
    std::cout.imbue(std::locale::global(rus_locale));
    /*Ввод значений переменных с клавиатуры*/
    std::cout << "Сколько сейчас часов? (0-23) ";
    std::cin >> h1; // Ввод часов
    std::cout << "Сколько сейчас минут? (0-59) ";
    std::cin >> m1; // Ввод минут
    unsigned int m2 = h1 * 60 + m1; // Текущее время перевели в минуты
    unsigned int m3 = 24 * 60;  // Время полуночи перевели в минуты
    unsigned int dm = m3 - m2; // Оставшееся время до полуночи в минутах
    unsigned int h2 = dm / 60; // Оставшееся время до полуночи в полных часах
    // Оставшееся количество минут до конца часа, вычисленного выше
    m2 = dm % 60;
    // --Вывод информации на экран--
    std::cout << "Текущее время: " << h1 << ":" << m1 << "\r\n";
    std::cout << "До полуночи осталось: " << h2 << ":" << m2 << "\r\n";
    // -- Задержка вывода на экран до нажатия клавиши "Ввод"
    std::cin.ignore(); // Очистка буффера ввода
    std::cin.get(); // Считывание символа с клавиатуры
    return 0; // Выход из программы (функции)

}
